Repository: baiyanwu/Whirl
Catalog: Whirl/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# about.developer
source: Developer
zh_hans: 开发者

# about.tagline
source: Fast app and window switching, without leaving your flow.
zh_hans: 快速切换 App 与窗口，不打断当前节奏。

# about.version_format
source: Version %@ (%@)
zh_hans: 版本 %@（%@）

# add_app.add
source: Add Shortcut
zh_hans: 添加快捷键

# add_app.choose_other
source: Choose Other App…
zh_hans: 选择其他 App…

# add_app.search
source: Search installed apps
zh_hans: 搜索已安装应用

# add_app.select_prompt
source: Select an application
zh_hans: 选择一个应用

# add_app.title
source: Add an application
zh_hans: 添加应用

# binding.error.duplicate_app
source: This app is already configured.
zh_hans: 该 App 已经配置。

# binding.error.duplicate_key
source: This key is already in use.
zh_hans: 该按键已被占用。

# binding.error.limit
source: You can configure up to 36 apps.
zh_hans: 最多可配置 36 个 App。

# bindings.add
source: Add App
zh_hans: 添加 App

# bindings.available_apps
source: Installed apps
zh_hans: 应用列表

# bindings.capture_placeholder
source: Press A–Z or 0–9
zh_hans: 按下 A–Z 或 0–9

# bindings.configure
source: Configure shortcut
zh_hans: 配置快捷键

# bindings.configured
source: Configured
zh_hans: 已配置

# bindings.configured_apps
source: Configured apps
zh_hans: 已配置应用

# bindings.drag_help
source: Drag to reorder
zh_hans: 拖动排序

# bindings.empty
source: No app shortcuts
zh_hans: 尚未配置快捷键

# bindings.empty_detail
source: Add an app and bind a letter or number.
zh_hans: 添加一个 App，并绑定字母或数字。

# bindings.press_key
source: Press a letter or number
zh_hans: 请按一个字母或数字

# bindings.search_empty
source: No matching apps
zh_hans: 没有匹配的应用

# bindings.subtitle
source: Hold the selected modifier to see these apps, or use a binding directly.
zh_hans: 长按所选修饰键查看这些 App，也可直接使用绑定键。

# bindings.title
source: App shortcuts
zh_hans: App 快捷键

# bindings.unavailable
source: Unavailable
zh_hans: 不可用

# common.back
source: Back
zh_hans: 返回

# common.cancel
source: Cancel
zh_hans: 取消

# common.continue
source: Continue
zh_hans: 继续

# common.open_settings
source: Open Settings
zh_hans: 打开设置

# error.activation_failed
source: Unable to activate %@.
zh_hans: 无法激活 %@。

# error.app_missing
source: %@ could not be found.
zh_hans: 找不到 %@。

# error.event_tap_failed
source: Global keyboard monitoring could not start. Check permissions, then restart Whirl.
zh_hans: 无法启动全局键盘监听，请检查权限后重新启动 Whirl。

# error.launch_at_login_requires_approval
source: macOS requires approval for Whirl in System Settings > General > Login Items.
zh_hans: macOS 要求你在“系统设置 > 通用 > 登录项”中批准 Whirl。

# error.open_system_settings_failed
source: System Settings could not be opened. Open Privacy & Security manually and authorize Whirl.
zh_hans: 无法打开系统设置，请手动进入“隐私与安全性”并授权 Whirl。

# error.window_open_failed
source: %@ is active, but no window could be opened.
zh_hans: %@ 已激活，但无法打开窗口。

# format.milliseconds
source: %d ms
zh_hans: %d 毫秒

# format.seconds
source: %d sec
zh_hans: %d 秒

# general.close_settings
source: Close Settings
zh_hans: 关闭设置窗口

# general.double_tap
source: Double-tap interval
zh_hans: 双击间隔

# general.include_tabs
source: Include application tabs
zh_hans: 包含应用标签页

# general.include_tabs_detail
source: Switch by tab in compatible apps such as Chrome and Safari.
zh_hans: 在 Chrome、Safari 等兼容 App 中按标签页切换。

# general.launch
source: Startup
zh_hans: 启动

# general.launch_at_login
source: Launch at login
zh_hans: 跟随系统启动

# general.long_press
source: Long-press threshold
zh_hans: 长按阈值

# general.switching_modifier
source: Switching trigger key
zh_hans: 切换触发键

# general.switching_modifier_scope
source: Use with A–Z or 0–9 to launch an app; hold to show the app list, or double-tap to switch windows.
zh_hans: 配合 A–Z 或 0–9 启动应用；长按显示应用列表，双击切换窗口。

# general.overlay
source: Overlay
zh_hans: 浮层

# general.overlay_centered
source: Centered
zh_hans: 居中

# general.overlay_layout
source: Picker layout
zh_hans: 切换布局

# general.overlay_layout_detail
source: Used by the application, window, and tab pickers.
zh_hans: 同时应用于应用、窗口和标签切换。

# general.overlay_lower
source: Bottom
zh_hans: 屏幕底部

# general.overlay_more_transparent
source: More transparent
zh_hans: 更透明

# general.overlay_opacity
source: Overlay background opacity
zh_hans: 浮层背景不透明度

# general.overlay_opacity_detail
source: Controls the background of both pickers without fading icons or text.
zh_hans: 同时控制双击窗口条和长按应用条的背景，不影响图标和文字。

# general.overlay_opaque
source: Opaque
zh_hans: 不透明

# general.overlay_upper
source: Top
zh_hans: 屏幕顶部

# general.overlay_vertical_position
source: Overlay position
zh_hans: 浮层纵向位置

# general.overlay_vertical_position_detail
source: Uses the current display's visible height: −100% is the bottom and +100% is the top. Applies to both pickers.
zh_hans: 按当前屏幕可见高度计算：−100% 位于底部，+100% 位于顶部；同时应用于双击窗口条和长按应用条。

# general.permissions
source: Permissions
zh_hans: 权限

# general.quit
source: Quit Whirl
zh_hans: 退出 Whirl

# general.trigger
source: Application Switching
zh_hans: 应用切换

# general.window_confirmation_key
source: Confirmation key
zh_hans: 确认按键

# general.window_number_shortcut_tip
source: Press Tab to cycle through windows or tabs; press 1–9 to select the matching number directly.
zh_hans: 按 Tab 可依次切换窗口或标签页；按数字键 1–9 可直接选择对应编号。

# general.window_picker_duration
source: Window bar duration
zh_hans: 窗口条停留时间

# general.window_switching
source: Window Switching
zh_hans: 窗口切换

# menu.close_settings
source: Close Whirl Settings
zh_hans: 关闭 Whirl 设置

# menu.open_settings
source: Open Settings…
zh_hans: 打开设置…

# menu.permissions_granted
source: Permissions Ready
zh_hans: 权限已就绪

# menu.permissions_required
source: Permissions Required
zh_hans: 需要授权

# menu.quit
source: Quit Whirl
zh_hans: 退出 Whirl

# menu.quit_completely
source: Quit Whirl Completely
zh_hans: 完全退出 Whirl

# overlay.no_bindings
source: No apps configured
zh_hans: 尚未配置应用

# overlay.no_bindings_detail
source: Open Settings to add your first shortcut.
zh_hans: 打开设置添加第一个快捷键。

# overlay_layout.fan
source: Fan
zh_hans: 扇形

# overlay_layout.horizontal
source: Horizontal
zh_hans: 横向

# permission.accessibility
source: Accessibility
zh_hans: 辅助功能

# permission.accessibility_detail
source: Required only for switching windows and tabs.
zh_hans: 仅在切换窗口和标签页时使用。

# permission.authorize
source: Authorize
zh_hans: 授权

# permission.debug_signature_note
source: This development build now uses a stable Apple Development signature. If you are upgrading from an older test build, remove the old Whirl entry in System Settings and add this version once.
zh_hans: 当前开发版本已使用固定的 Apple Development 签名。若从旧测试版升级后仍未识别，请在系统设置中移除旧 Whirl 条目，再添加当前版本一次。

# permission.refresh
source: Refresh permission status
zh_hans: 刷新权限状态

# permission.restart
source: Restart Whirl
zh_hans: 重新启动 Whirl

# permission.status_follow_settings
source: Enable Whirl in System Settings. This page will refresh automatically.
zh_hans: 请在系统设置中启用 Whirl，此页面会自动刷新。

# permission.status_not_detected
source: Refreshed, but macOS still reports that one or more permissions are unavailable.
zh_hans: 已刷新，但 macOS 仍报告一个或多个权限尚未生效。

# permission.status_ready
source: Permissions ready
zh_hans: 权限已就绪

# permission.troubleshooting
source: If a permission is enabled but not detected, turn it off and on again, then restart Whirl.
zh_hans: 如果系统设置已开启但仍未识别，请先关闭再重新开启对应权限，然后重新启动 Whirl。

# permission.window_selection_required
source: Double-press window selection requires Accessibility permission.
zh_hans: 双击窗口选择需要辅助功能权限。

# settings.about
source: About
zh_hans: 关于

# settings.bindings
source: Shortcuts
zh_hans: 快捷配置

# settings.general
source: General
zh_hans: 基础设置

# settings.title
source: Whirl Settings
zh_hans: Whirl 设置

source: Unknown Application
zh_hans: 未知应用

# welcome.binding_detail
source: Choose an app, then press one letter or number.
zh_hans: 选择一个 App，然后按下一个字母或数字。

# welcome.binding_title
source: Create your first shortcut
zh_hans: 创建第一个快捷键

# welcome.change_app
source: Choose a different app
zh_hans: 更换 App

# welcome.configure_later
source: Configure later
zh_hans: 稍后配置

# welcome.done_detail
source: Whirl will remain in the menu bar. Open Settings any time by clicking its icon.
zh_hans: Whirl 将常驻菜单栏，点击图标即可随时打开设置。

# welcome.done_title
source: Whirl is ready
zh_hans: Whirl 已准备就绪

# welcome.feature_apps
source: Hold modifier
zh_hans: 长按修饰键

# welcome.feature_shortcut
source: Modifier + key
zh_hans: 修饰键 + 按键

# welcome.feature_windows
source: Double-tap modifier
zh_hans: 双击修饰键

# welcome.finish
source: Finish
zh_hans: 完成

# welcome.permissions_detail
source: Accessibility is used only to list and focus windows or tabs. App switching does not require it.
zh_hans: 辅助功能仅用于列举和聚焦窗口或标签页，应用切换不需要此权限。

# welcome.permissions_title
source: Grant required permissions
zh_hans: 授予必要权限

# welcome.subtitle
source: A lightweight launcher for quickly switching apps and windows.
zh_hans: 快速启动 App、切换应用与窗口的轻量工具。

# welcome.title
source: Welcome to Whirl
zh_hans: 欢迎使用 Whirl

# welcome.trigger_detail
source: The selected modifier is used for shortcuts, long press, and double tap. You can change it later in Settings.
zh_hans: 所选修饰键用于快捷键、长按和双击，之后可随时在设置中修改。

# welcome.trigger_title
source: Choose your app switching shortcut
zh_hans: 选择应用切换快捷键

# welcome.try_double
source: Double-tap the selected modifier to switch windows
zh_hans: 双击所选修饰键切换当前 App 窗口

# welcome.try_hold
source: Hold the selected modifier to reveal your app bar
zh_hans: 长按所选修饰键显示应用横条

# welcome.try_shortcut
source: Selected modifier + bound key launches or switches an app
zh_hans: 所选修饰键 + 绑定键启动或切换 App

# welcome.window_title
source: Welcome to Whirl
zh_hans: 欢迎使用 Whirl

# window.activation_failed
source: Unable to switch to that window.
zh_hans: 无法切换到该窗口。

# window.no_frontmost_app
source: No active application found.
zh_hans: 未找到当前应用。

# window.none
source: %@ has no switchable windows.
zh_hans: %@ 没有可切换的窗口。

# window.tab_in_application
source: %@ Tab
zh_hans: %@ 标签页

# window.untitled
source: Untitled Window
zh_hans: 未命名窗口

# window.untitled_tab
source: Untitled Tab
zh_hans: 未命名标签页
